<?php
# TODO list
#
// TODO
# fulltext == fulltext при пустом - нафига?
# FIXED

// TODO
# выбор категории идёт без учета вложенности
# FIXED

// TODO
# экспорт из категории происходит без учета вложенных категорий
# FIXED

// TODO
# при экспорте всё равно зачем-то конвертится в CP1251
# FIXED

// TODO
# при экспорте сделать categoryname с именем категории
# FIXED частично - только path

// TODO
# при импорте облом если есть ID у статьи даже если такой статьи нет
# ну и ладно, по идее верная логика

// TODO
# при иморте категория опознается не по названию а по id
# FIXED - если пропущена id категории то она опознается по path, правда пока не создается

// TODO
# новая настройка галочки конвертирования по умолчанию
# FIXED

// TODO
# BOM не обрабатывался
# FIXED


// TODO
# надо сделать создание новых категорий, если их нет, с родителем, заданным в настройках
#

// TODO
# надо сделать вложенные категории с разделением через /
#

// TODO
# соответсвенно надо создавать категорию
#
// TODO
# в идеале и вовсе отправлять (синхронизировать) с Google Docs
#


?>
